In [3]:
# import pandas as pd 
import pandas as pd 

# list of strings 
list = ['CSC', '102','is','the','best','course','ever']

#  Calling DataFrame constructor on list
df = pd.DataFrame(list)

# Print the output.
df

        0
0     CSC
1     102
2      is
3     the
4    best
5  course
6    ever

In [4]:
import pandas as pd 

# intialise data of lists.
data = {'Name':['Angela','Precious','Luis','Ade'],
        'Age':[20,21,19,20]}

# Create Dataframe
df = pd.DataFrame(data)

# Print the output.
df

       Name  Age
0    Angela   20
1  Precious   21
2      Luis   19
3       Ade   20

In [8]:
# Import pandas package 
import pandas as pd 

# Define a dictionary containing employee data 
data = {'Name':['Clem','Prince','Edward','Adele'],
        'Age':[27,24,22,32],
        'Address':['Abuja','Kano','Minna','Lagos'],
        'Qualification':['Msc','MA','MCA','Phd']}

# Convert the dictionary into DataFrame
df = pd.DataFrame(data)

# select two columns
df[['Name', 'Qualification']]

     Name Qualification
0    Clem           Msc
1  Prince            MA
2  Edward           MCA
3   Adele           Phd

In [13]:
import pandas as pg

# Define a dictionary containing employee data
data = {'Name':['Oyin', 'Mary', 'David','Bola'],
        'Age':[27,24,22,32],
        'Address':['Asaba','Maiduguri','Onitsha','Kwara'],
        'Qualification':['Msc','MA','MCA','Phd']}

# Convert the dictionary into DataFrame
df = pg.DataFrame(data)

# select first row
df.iloc[0]

Name              Oyin
Age                 27
Address          Asaba
Qualification      Msc
Name: 0, dtype: object

In [18]:
# importing pandas package 
import pandas as pd 

# making data frame from csv file
data = pd.read_csv("employee_records (3).csv")

# print excel
data

    Employee Names  Years  Assesment Records  Points  Reward
0      Matthew Ade     25              125.3      21  438.55
1   Angela Adebisi     15               77.9      14  181.77
2  Calistus Ndukwe     10              144.2      18  432.60
3   Martha Martins      9               81.5      25  339.58
4    Victor Sayola     18               77.8      33  427.90
5      Adamu Bello     23               99.5      24  398.00

In [21]:
# importing pandas package
import pandas as pd

# making data frame from csv file
data = pd.read_csv("employee_records (3).csv")

df=data.iloc[0]

# print excel
df

Employee Names       Matthew Ade
Years                         25
Assesment Records          125.3
Points                        21
Reward                    438.55
Name: 0, dtype: object

In [26]:
# importing pandas package 
import pandas as pd

# making data frame from csv file 
data = pd.read_csv("employee_records (3).csv")

df=data.head(1)

# print excel
df

  Employee Names  Years  Assesment Records  Points  Reward
0    Matthew Ade     25              125.3      21  438.55

In [29]:
# importing pandas as pd 
import pandas as pd 

# dictionary of lists
dict = {'name':["Abdul","Chukwuemeka","Seyi","Matt"],
       'degree':["MBA","BCA","M.Tech","MBA"],
       'score':[90, 40, 80, 98]}

# creating a dataframe from a dictionary 
df = pd.DataFrame(dict)

# iterating over rows using iterrows() function
for i, j in df.iterrows():
    print(i,j)
    print()

0 name      Abdul
degree      MBA
score        90
Name: 0, dtype: object

1 name      Chukwuemeka
degree            BCA
score              40
Name: 1, dtype: object

2 name        Seyi
degree    M.Tech
score         80
Name: 2, dtype: object

3 name      Matt
degree     MBA
score       98
Name: 3, dtype: object

In [41]:
# importing pandas as pd
import pandas as pd
   
# dictionary of lists
dict = {'name':["Bello", "Kamara", "Ugochi", "David"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
  
# creating a dataframe from a dictionary 
dfs = pd.DataFrame(dict)

# creating a list of dataframe columns
columns = list(dfs)
 
for i in columns:
 
    # printing the third element of the column
    print (dfs[i][2])

TypeError: 'list' object is not callable

In [45]:
# importing pandas as pd
import pandas as pd
   
# dictionary of lists
record = {'name':["Abel", "Kamsi", "Oyode", "Chinelo"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
  
# creating a dataframe from a dictionary 
df = pd.DataFrame(record)

# saving the dataframe
df.to_csv('record.csv')